# IFCAggregate Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCAggregate Class
Members See Also
---
A collection of IFC handles or attributes.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class IFCAggregate : IEnumerable<IFCData>,
	IDisposable
```

Visual Basic
---
```text
Public Class IFCAggregate _
	Implements IEnumerable(Of IFCData), IDisposable
```

Visual C++
---
```text
public ref class IFCAggregate : IEnumerable<IFCData^>,
	IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.IFC..::..IFCAggregate
# See Also
IFCAggregate Members
Autodesk.Revit.DB.IFC Namespace